Revit 2027 API
IExternalDataManagerServer.GetCommandsForAdd Method
 Retrieves commands in the Add menu.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
IList<ExternalDataManagerCommandId> GetCommandsForAdd()
Function GetCommandsForAdd As IList(Of ExternalDataManagerCommandId)
IList<ExternalDataManagerCommandId^>^ GetCommandsForAdd()
abstract GetCommandsForAdd : unit -> IList<ExternalDataManagerCommandId>
Return Value
IList<ExternalDataManagerCommandId>
 The commands ids for the Add menu.
Remarks
 The returned ids define the drop-down list attached to the "Add" button in the dialog toolbar. Return an empty array if the server does not support adding new content. The ids must correspond to commands previously registered via ExternalDataManagerCommand.registerCommand.
See Also
Reference
IExternalDataManagerServer Interface
Autodesk.Revit.UI Namespace